In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns # This packages runs on top of matplotlib and create beautiful plots/visualizations.

C:\Users\ajitp\Anaconda3\lib\site-packages\statsmodels\tools\_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
# When you run a Jupyter cell,
# You can see some return messages

# They can be Error or Warnings.

In [16]:
df = pd.read_csv('student-mat.csv', delimiter=';') # delimiter is also as separator.

In [17]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

In [18]:
df.columns

Index(['school', 'sex', 'age', 'address', 'famsize', 'Pstatus', 'Medu', 'Fedu',
       'Mjob', 'Fjob', 'reason', 'guardian', 'traveltime', 'studytime',
       'failures', 'schoolsup', 'famsup', 'paid', 'activities', 'nursery',
       'higher', 'internet', 'romantic', 'famrel', 'freetime', 'goout', 'Dalc',
       'Walc', 'health', 'absences', 'G1', 'G2', 'G3'],
      dtype='object')

In [19]:
# Whats the type of each column in Pandas DataFrame?
# Whats the datatype of every column in Pandas DataFrame?

# Column is Pandas Series

In [20]:
df.groupby(['school'])['age'].count()

school
GP    349
MS     46
Name: age, dtype: int64

In [21]:
result1 = df.groupby(['school'])['age'].count()

In [22]:
result1.to_csv('result1.csv')

In [23]:
df['number_of_students'] = 1

In [24]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3,number_of_students
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,3,4,1,1,3,6,5,6,6,1
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,3,3,1,1,3,4,5,5,6,1
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,3,2,2,3,3,10,7,8,10,1
3,GP,F,15,U,GT3,T,4,2,health,services,...,2,2,1,1,5,2,15,14,15,1
4,GP,F,16,U,GT3,T,3,3,other,other,...,3,2,1,2,5,4,6,10,10,1

In [26]:
df.groupby(['school'])['number_of_students'].count()

school
GP    349
MS     46
Name: number_of_students, dtype: int64

In [ ]:
# When something confuses you, it would confuse others as well.
# When someone writes/uses ambiguous/confusing names, it becomes harder for successors.

# ABC as Data Analyst - I write everything (code and conventions) very poorly.
# Resigned
# ABC as Data Analyst - It would make one's like quite difficult.

In [ ]:
# Python & Pandas Best Practices Includes

# use clear column names, which makes sense (Good Eg, Free_Time, FreeTime, freetime) (Bad Eg, FT - Its must be documented) 
# use clear and functional names for functions
# use clear and functional names for variables

In [27]:
avg_age_of_students = df['age'].mean() # Good Example

In [28]:
avg_age_of_students

16.696202531645568

In [31]:
avgAgeOfStudents = df['age'].mean() # Good Example

In [32]:
avgAgeOfStudents

16.696202531645568

In [29]:
aaos = df['age'].mean() # Bad Example

In [30]:
aaos

16.696202531645568

In [33]:
df.groupby(['school', 'sex'])['number_of_students'].count()

school  sex
GP      F      183
        M      166
MS      F       25
        M       21
Name: number_of_students, dtype: int64

In [ ]:
# Dimension
# Fact/Measure/Metric/Value

In [47]:
result2 = df.groupby(['school', 'sex'])['number_of_students'].count() # Aggregation

In [45]:
result2

school  sex
GP      F      1
        M      1
MS      F      1
        M      1
Name: number_of_students, dtype: int64

In [48]:
result2 = df.groupby(['school', 'sex'])['age'].mean() # Aggregation

In [49]:
result2

school  sex
GP      F      16.579235
        M      16.457831
MS      F      17.840000
        M      18.238095
Name: age, dtype: float64

In [36]:
# For each of the dataframe, you have three things associated with a dataframe.
# Three components of a DataFrame

# Index
# Columns
# Rows / Instances / Records

In [39]:
# For each of the Pandas Series, again, you've three components

# Index
# Column (Only one column)
# Rows / Instances / Records

In [37]:
result2

school  sex
GP      F      183
        M      166
MS      F       25
        M       21
Name: number_of_students, dtype: int64

In [38]:
type(result2)

pandas.core.series.Series

In [ ]:
# You can extract data vertically or Horizontally from a DataFrame or Series.

# Horizontal Data - Rows / Instances
# Vertical Data - Index & Columns/Values

In [40]:
result2[0] # When you show data with row number, this will only show columns and not index.

183

In [41]:
result2.index

MultiIndex([('GP', 'F'),
            ('GP', 'M'),
            ('MS', 'F'),
            ('MS', 'M')],
           names=['school', 'sex'])

In [42]:
result2.values

array([183, 166,  25,  21], dtype=int64)

In [ ]:
# In statistics, we have many aggregation functions

# Count
# Mean
# Median
# Mode
# Min
# Max

In [50]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3,number_of_students
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,3,4,1,1,3,6,5,6,6,1
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,3,3,1,1,3,4,5,5,6,1
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,3,2,2,3,3,10,7,8,10,1
3,GP,F,15,U,GT3,T,4,2,health,services,...,2,2,1,1,5,2,15,14,15,1
4,GP,F,16,U,GT3,T,3,3,other,other,...,3,2,1,2,5,4,6,10,10,1

In [51]:
df.columns

Index(['school', 'sex', 'age', 'address', 'famsize', 'Pstatus', 'Medu', 'Fedu',
       'Mjob', 'Fjob', 'reason', 'guardian', 'traveltime', 'studytime',
       'failures', 'schoolsup', 'famsup', 'paid', 'activities', 'nursery',
       'higher', 'internet', 'romantic', 'famrel', 'freetime', 'goout', 'Dalc',
       'Walc', 'health', 'absences', 'G1', 'G2', 'G3', 'number_of_students'],
      dtype='object')

In [60]:
df[['school', 'sex','age','traveltime','studytime']]

    school sex  age  traveltime  studytime
0       GP   F   18           2          2
1       GP   F   17           1          2
2       GP   F   15           1          2
3       GP   F   15           1          3
4       GP   F   16           1          2
..     ...  ..  ...         ...        ...
390     MS   M   20           1          2
391     MS   M   17           2          1
392     MS   M   21           1          1
393     MS   M   18           3          1
394     MS   M   19           1          1

[395 rows x 5 columns]

In [84]:
df[0]

KeyError: 0

In [55]:
x = np.array([1, 2, 3, 4, 5])

In [56]:
x[0]

1

In [57]:
df()

TypeError: 'DataFrame' object is not callable

In [ ]:
# all the functions are callable

# the data structures are not callable

In [58]:
x()

TypeError: 'numpy.ndarray' object is not callable

In [59]:
x.mean()

3.0

In [63]:
df[['school', 'sex','age','traveltime','studytime']].head()

  school sex  age  traveltime  studytime
0     GP   F   18           2          2
1     GP   F   17           1          2
2     GP   F   15           1          2
3     GP   F   15           1          3
4     GP   F   16           1          2

In [64]:
df_small = df[['school', 'sex','age','traveltime','studytime']]

In [80]:
df_small.iloc[[1, 5, 6, 8, 10]]

   school sex  age  traveltime  studytime
1      GP   F   17           1          2
5      GP   M   16           1          2
6      GP   M   16           1          2
8      GP   M   15           1          2
10     GP   F   15           1          2

In [82]:
df_small['school']

0      GP
1      GP
2      GP
3      GP
4      GP
       ..
390    MS
391    MS
392    MS
393    MS
394    MS
Name: school, Length: 395, dtype: object

In [65]:
df_small.head()

  school sex  age  traveltime  studytime
0     GP   F   18           2          2
1     GP   F   17           1          2
2     GP   F   15           1          2
3     GP   F   15           1          3
4     GP   F   16           1          2

In [67]:
df_small.tail(10)

    school sex  age  traveltime  studytime
385     MS   F   18           2          3
386     MS   F   18           3          1
387     MS   F   19           1          3
388     MS   F   18           1          2
389     MS   F   18           2          2
390     MS   M   20           1          2
391     MS   M   17           2          1
392     MS   M   21           1          1
393     MS   M   18           3          1
394     MS   M   19           1          1

In [72]:
df_small.iloc[15:20]

   school sex  age  traveltime  studytime
15     GP   F   16           1          1
16     GP   F   16           1          3
17     GP   F   16           3          2
18     GP   M   17           1          1
19     GP   M   16           1          1

In [70]:
df_small.iloc[0::2]

    school sex  age  traveltime  studytime
0       GP   F   18           2          2
3       GP   F   15           1          3
6       GP   M   16           1          2
9       GP   M   15           1          2
12      GP   M   15           1          1
..     ...  ..  ...         ...        ...
381     MS   M   18           2          1
384     MS   M   18           2          1
387     MS   F   19           1          3
390     MS   M   20           1          2
393     MS   M   18           3          1

[132 rows x 5 columns]

In [76]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3,number_of_students
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,3,4,1,1,3,6,5,6,6,1
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,3,3,1,1,3,4,5,5,6,1
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,3,2,2,3,3,10,7,8,10,1
3,GP,F,15,U,GT3,T,4,2,health,services,...,2,2,1,1,5,2,15,14,15,1
4,GP,F,16,U,GT3,T,3,3,other,other,...,3,2,1,2,5,4,6,10,10,1

In [77]:
df.iloc[15:20, [0, 1, 2, 5, 6]]

   school sex  age Pstatus  Medu
15     GP   F   16       T     4
16     GP   F   16       T     4
17     GP   F   16       T     3
18     GP   M   17       T     3
19     GP   M   16       T     4